{
  "title": "Handle ambiguous 'salt' ingredient with Diamond Crystal default",
  "description": "\"salt\" is the #1 unknown ingredient in the density gap report (1,093 occurrences), with \"kosher salt\" at #2 (592) and \"sea salt\" / \"fine sea salt\" adding another 277. Currently all salt variants are mapped to null (explicitly ambiguous) because Diamond Crystal and Morton kosher salt have very different densities by volume.\n\nDecisions made after research:\n\n1. **Global rename approach, NOT per-site domain overrides.** We investigated per-site overrides (e.g., smittenkitchen uses Diamond Crystal) but most sites don't clearly document their salt convention, and the few sources we found were unreliable. Domain overrides are not the right solution here. (PR #267 attempted this and was closed.)\n\n2. **Rename 'salt' to 'salt, presumably Diamond' in the pipeline.** This makes the assumption visible to the reader so they know they might need to add more. Per Deb Perelman (smittenkitchen): unspecified 'salt' most likely means Diamond Crystal, and you can always add more later.\n\n3. **Give 'salt, presumably Diamond' Diamond Crystal's density (137 g/cup).** This enables volume-to-weight conversion with the most conservative (lowest density) assumption.\n\n4. **Fine sea salt is NOT the same density as table salt.** Fine sea salt is ~170-240 g/cup, not ~292 g/cup. Do NOT alias fine sea salt variants to table salt. Mark 'fine salt' and 'fine sea salt' as ambiguous (null).\n\n5. **Keep 'table salt' → 'salt, table' alias** (unambiguous at ~292 g/cup). Keep 'kosher salt' and 'sea salt' as ambiguous (null) since brand/grind matters.\n\nImplementation notes:\n- Add a 'rewrites' concept to curated.json: {\"salt\": \"salt, presumably Diamond\"}\n- Add alias: 'salt, presumably diamond' → 'diamond crystal kosher salt'\n- Change 'salt' alias from null to 'diamond crystal kosher salt' so find_density returns 137.0\n- Apply rewrites in the pipeline (parse_ingredients step) before density lookup\n- Also apply rewrites in test runners (ingredient_parsing_tests.rs, cli/ingredient_tests.rs) so golden files match\n- Add 'diamond crystal kosher salt' as a curated ingredient with 137.0 g/cup, source: seriouseats.com\n- Make sure `make test` passes fully, including golden file tests under process-compose — the previous attempt had golden file tests taking ~190s which caused process-compose timeouts. Investigate whether this is a pre-existing issue or was caused by the changes.",
  "status": "open",
  "priority": 2,
  "type": "task",
  "labels": ["ingredient-density"],
  "created_at": "2026-02-08T20:40:00.000000+00:00",
  "updated_at": "2026-02-08T21:40:00.000000+00:00"
}
